---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintSegmentLength Properties
RebarShapeConstraintSegmentLength Class See Also Send Feedback
---

The RebarShapeConstraintSegmentLength type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also

RebarShapeConstraintSegmentLength Class

Autodesk.Revit.DB.Structure Namespace